<?php

use App\Model\Surah;
use App\Model\Ayat;
use Illuminate\Database\Seeder;

class AyahTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $ayat = [
            [
                " عَمَّ يَتَسَآءَلُونَ",
                1,
                78
            ],
            [
                "عَنِ ٱلنَّبَإِ ٱلْعَظِيمِ",
                2,
                78
            ],
            [
                "ٱلَّذِى هُمْ فِيهِ مُخْتَلِفُونَ",
                3,
                78
            ],
            [
                "كَلَّا سَيَعْلَمُونَ",
                4,
                78
            ],
            [
                "ثُمَّ كَلَّا سَيَعْلَمُونَ",
                5,
                78
            ],
            [
                "أَلَمْ نَجْعَلِ ٱلْأَرْضَ مِهَٰدًۭا",
                6,
                78
            ],
            [
                "وَٱلْجِبَالَ أَوْتَادًۭا",
                7,
                78
            ],
            [
                "وَخَلَقْنَٰكُمْ أَزْوَٰجًۭا",
                8,
                78
            ],
            [
                "وَجَعَلْنَا نَوْمَكُمْ سُبَاتًۭا",
                9,
                78
            ],
            [
                "وَجَعَلْنَا ٱلَّيْلَ لِبَاسًۭا",
                10,
                78
            ],
            [
                "وَجَعَلْنَا ٱلنَّهَارَ مَعَاشًۭا",
                11,
                78
            ],
            [
                "وَبَنَيْنَا فَوْقَكُمْ سَبْعًۭا شِدَادًۭا",
                12,
                78
            ],
            [
                "وَجَعَلْنَا سِرَاجًۭا وَهَّاجًۭا",
                13,
                78
            ],
            [
                "وَأَنزَلْنَا مِنَ ٱلْمُعْصِرَٰتِ مَآءًۭ ثَجَّاجًۭا",
                14,
                78
            ],
            [
                "لِّنُخْرِجَ بِهِۦ حَبًّۭا وَنَبَاتًۭا",
                15,
                78
            ],
            [
                "وَجَنَّٰتٍ أَلْفَافًا",
                16,
                78
            ],
            [
                "إِنَّ يَوْمَ ٱلْفَصْلِ كَانَ مِيقَٰتًۭا",
                17,
                78
            ],
            [
                "يَوْمَ يُنفَخُ فِى ٱلصُّورِ فَتَأْتُونَ أَفْوَاجًۭا",
                18,
                78
            ],
            [
                "وَفُتِحَتِ ٱلسَّمَآءُ فَكَانَتْ أَبْوَٰبًۭا",
                19,
                78
            ],
            [
                "وَسُيِّرَتِ ٱلْجِبَالُ فَكَانَتْ سَرَابًا",
                20,
                78
            ],
            [
                "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًۭا",
                21,
                78
            ],
            [
                "لِّلطَّٰغِينَ مَـَٔابًۭا",
                22,
                78
            ],
            [
                "لَّٰبِثِينَ فِيهَآ أَحْقَابًۭا",
                23,
                78
            ],
            [
                "لَّا يَذُوقُونَ فِيهَا بَرْدًۭا وَلَا شَرَابًا",
                24,
                78
            ],
            [
                "إِلَّا حَمِيمًۭا وَغَسَّاقًۭا",
                25,
                78
            ],
            [
                "جَزَآءًۭ وِفَاقًا",
                26,
                78
            ],
            [
                "إِنَّهُمْ كَانُوا۟ لَا يَرْجُونَ حِسَابًۭا",
                27,
                78
            ],
            [
                "وَكَذَّبُوا۟ بِـَٔايَٰتِنَا كِذَّابًۭا",
                28,
                78
            ],
            [
                "وَكُلَّ شَىْءٍ أَحْصَيْنَٰهُ كِتَٰبًۭا",
                29,
                78
            ],
            [
                "فَذُوقُوا۟ فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا",
                30,
                78
            ],
            [
                "إِنَّ لِلْمُتَّقِينَ مَفَازًا",
                31,
                78
            ],
            [
                "حَدَآئِقَ وَأَعْنَٰبًۭا",
                32,
                78
            ],
            [
                "وَكَوَاعِبَ أَتْرَابًۭا",
                33,
                78
            ],
            [
                "وَكَأْسًۭا دِهَاقًۭا",
                34,
                78
            ],
            [
                "لَّا يَسْمَعُونَ فِيهَا لَغْوًۭا وَلَا كِذَّٰبًۭا",
                35,
                78
            ],
            [
                "جَزَآءًۭ مِّن رَّبِّكَ عَطَآءً حِسَابًۭا",
                36,
                78
            ],
            [
                "رَّبِّ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلرَّحْمَٰنِ ۖ لَا يَمْلِكُونَ مِنْهُ خِطَابًۭا",
                37,
                78
            ],
            [
                "يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلَٰٓئِكَةُ صَفًّۭا ۖ لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَٰنُ وَقَالَ صَوَابًۭا",
                38,
                78
            ],
            [
                "ذَٰلِكَ ٱلْيَوْمُ ٱلْحَقُّ ۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا",
                39,
                78
            ],
            [
                "إِنَّآ أَنذَرْنَٰكُمْ عَذَابًۭا قَرِيبًۭا يَوْمَ يَنظُرُ ٱلْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ ٱلْكَافِرُ يَٰلَيْتَنِى كُنتُ تُرَٰبًۢا",
                40,
                78
            ],
            [
                " وَٱلنَّٰزِعَٰتِ غَرْقًۭا",
                1,
                79
            ],
            [
                "وَٱلنَّٰشِطَٰتِ نَشْطًۭا",
                2,
                79
            ],
            [
                "وَٱلسَّٰبِحَٰتِ سَبْحًۭا",
                3,
                79
            ],
            [
                "فَٱلسَّٰبِقَٰتِ سَبْقًۭا",
                4,
                79
            ],
            [
                "فَٱلْمُدَبِّرَٰتِ أَمْرًۭا",
                5,
                79
            ],
            [
                "يَوْمَ تَرْجُفُ ٱلرَّاجِفَةُ",
                6,
                79
            ],
            [
                "تَتْبَعُهَا ٱلرَّادِفَةُ",
                7,
                79
            ],
            [
                "قُلُوبٌۭ يَوْمَئِذٍۢ وَاجِفَةٌ",
                8,
                79
            ],
            [
                "أَبْصَٰرُهَا خَٰشِعَةٌۭ",
                9,
                79
            ],
            [
                "يَقُولُونَ أَءِنَّا لَمَرْدُودُونَ فِى ٱلْحَافِرَةِ",
                10,
                79
            ],
            [
                "أَءِذَا كُنَّا عِظَٰمًۭا نَّخِرَةًۭ",
                11,
                79
            ],
            [
                "قَالُوا۟ تِلْكَ إِذًۭا كَرَّةٌ خَاسِرَةٌۭ",
                12,
                79
            ],
            [
                "فَإِنَّمَا هِىَ زَجْرَةٌۭ وَٰحِدَةٌۭ",
                13,
                79
            ],
            [
                "فَإِذَا هُم بِٱلسَّاهِرَةِ",
                14,
                79
            ],
            [
                "هَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ",
                15,
                79
            ],
            [
                "إِذْ نَادَىٰهُ رَبُّهُۥ بِٱلْوَادِ ٱلْمُقَدَّسِ طُوًى",
                16,
                79
            ],
            [
                "ٱذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ",
                17,
                79
            ],
            [
                "فَقُلْ هَل لَّكَ إِلَىٰٓ أَن تَزَكَّىٰ",
                18,
                79
            ],
            [
                "وَأَهْدِيَكَ إِلَىٰ رَبِّكَ فَتَخْشَىٰ",
                19,
                79
            ],
            [
                "فَأَرَىٰهُ ٱلْءَايَةَ ٱلْكُبْرَىٰ",
                20,
                79
            ],
            [
                "فَكَذَّبَ وَعَصَىٰ",
                21,
                79
            ],
            [
                "ثُمَّ أَدْبَرَ يَسْعَىٰ",
                22,
                79
            ],
            [
                "فَحَشَرَ فَنَادَىٰ",
                23,
                79
            ],
            [
                "فَقَالَ أَنَا۠ رَبُّكُمُ ٱلْأَعْلَىٰ",
                24,
                79
            ],
            [
                "فَأَخَذَهُ ٱللَّهُ نَكَالَ ٱلْءَاخِرَةِ وَٱلْأُولَىٰٓ",
                25,
                79
            ],
            [
                "إِنَّ فِى ذَٰلِكَ لَعِبْرَةًۭ لِّمَن يَخْشَىٰٓ",
                26,
                79
            ],
            [
                "ءَأَنتُمْ أَشَدُّ خَلْقًا أَمِ ٱلسَّمَآءُ ۚ بَنَىٰهَا",
                27,
                79
            ],
            [
                "رَفَعَ سَمْكَهَا فَسَوَّىٰهَا",
                28,
                79
            ],
            [
                "وَأَغْطَشَ لَيْلَهَا وَأَخْرَجَ ضُحَىٰهَا",
                29,
                79
            ],
            [
                "وَٱلْأَرْضَ بَعْدَ ذَٰلِكَ دَحَىٰهَآ",
                30,
                79
            ],
            [
                "أَخْرَجَ مِنْهَا مَآءَهَا وَمَرْعَىٰهَا",
                31,
                79
            ],
            [
                "وَٱلْجِبَالَ أَرْسَىٰهَا",
                32,
                79
            ],
            [
                "مَتَٰعًۭا لَّكُمْ وَلِأَنْعَٰمِكُمْ",
                33,
                79
            ],
            [
                "فَإِذَا جَآءَتِ ٱلطَّآمَّةُ ٱلْكُبْرَىٰ",
                34,
                79
            ],
            [
                "يَوْمَ يَتَذَكَّرُ ٱلْإِنسَٰنُ مَا سَعَىٰ",
                35,
                79
            ],
            [
                "وَبُرِّزَتِ ٱلْجَحِيمُ لِمَن يَرَىٰ",
                36,
                79
            ],
            [
                "فَأَمَّا مَن طَغَىٰ",
                37,
                79
            ],
            [
                "وَءَاثَرَ ٱلْحَيَوٰةَ ٱلدُّنْيَا",
                38,
                79
            ],
            [
                "فَإِنَّ ٱلْجَحِيمَ هِىَ ٱلْمَأْوَىٰ",
                39,
                79
            ],
            [
                "وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِۦ وَنَهَى ٱلنَّفْسَ عَنِ ٱلْهَوَىٰ",
                40,
                79
            ],
            [
                "فَإِنَّ ٱلْجَنَّةَ هِىَ ٱلْمَأْوَىٰ",
                41,
                79
            ],
            [
                "يَسْـَٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرْسَىٰهَا",
                42,
                79
            ],
            [
                "فِيمَ أَنتَ مِن ذِكْرَىٰهَآ",
                43,
                79
            ],
            [
                "إِلَىٰ رَبِّكَ مُنتَهَىٰهَآ",
                44,
                79
            ],
            [
                "إِنَّمَآ أَنتَ مُنذِرُ مَن يَخْشَىٰهَا",
                45,
                79
            ],
            [
                "كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوٓا۟ إِلَّا عَشِيَّةً أَوْ ضُحَىٰهَا",
                46,
                79
            ],
            [
                " عَبَسَ وَتَوَلَّىٰٓ",
                1,
                80
            ],
            [
                "أَن جَآءَهُ ٱلْأَعْمَىٰ",
                2,
                80
            ],
            [
                "وَمَا يُدْرِيكَ لَعَلَّهُۥ يَزَّكَّىٰٓ",
                3,
                80
            ],
            [
                "أَوْ يَذَّكَّرُ فَتَنفَعَهُ ٱلذِّكْرَىٰٓ",
                4,
                80
            ],
            [
                "أَمَّا مَنِ ٱسْتَغْنَىٰ",
                5,
                80
            ],
            [
                "فَأَنتَ لَهُۥ تَصَدَّىٰ",
                6,
                80
            ],
            [
                "وَمَا عَلَيْكَ أَلَّا يَزَّكَّىٰ",
                7,
                80
            ],
            [
                "وَأَمَّا مَن جَآءَكَ يَسْعَىٰ",
                8,
                80
            ],
            [
                "وَهُوَ يَخْشَىٰ",
                9,
                80
            ],
            [
                "فَأَنتَ عَنْهُ تَلَهَّىٰ",
                10,
                80
            ],
            [
                "كَلَّآ إِنَّهَا تَذْكِرَةٌۭ",
                11,
                80
            ],
            [
                "فَمَن شَآءَ ذَكَرَهُۥ",
                12,
                80
            ],
            [
                "فِى صُحُفٍۢ مُّكَرَّمَةٍۢ",
                13,
                80
            ],
            [
                "مَّرْفُوعَةٍۢ مُّطَهَّرَةٍۭ",
                14,
                80
            ],
            [
                "بِأَيْدِى سَفَرَةٍۢ",
                15,
                80
            ],
            [
                "كِرَامٍۭ بَرَرَةٍۢ",
                16,
                80
            ],
            [
                "قُتِلَ ٱلْإِنسَٰنُ مَآ أَكْفَرَهُۥ",
                17,
                80
            ],
            [
                "مِنْ أَىِّ شَىْءٍ خَلَقَهُۥ",
                18,
                80
            ],
            [
                "مِن نُّطْفَةٍ خَلَقَهُۥ فَقَدَّرَهُۥ",
                19,
                80
            ],
            [
                "ثُمَّ ٱلسَّبِيلَ يَسَّرَهُۥ",
                20,
                80
            ],
            [
                "ثُمَّ أَمَاتَهُۥ فَأَقْبَرَهُۥ",
                21,
                80
            ],
            [
                "ثُمَّ إِذَا شَآءَ أَنشَرَهُۥ",
                22,
                80
            ],
            [
                "كَلَّا لَمَّا يَقْضِ مَآ أَمَرَهُۥ",
                23,
                80
            ],
            [
                "فَلْيَنظُرِ ٱلْإِنسَٰنُ إِلَىٰ طَعَامِهِۦٓ",
                24,
                80
            ],
            [
                "أَنَّا صَبَبْنَا ٱلْمَآءَ صَبًّۭا",
                25,
                80
            ],
            [
                "ثُمَّ شَقَقْنَا ٱلْأَرْضَ شَقًّۭا",
                26,
                80
            ],
            [
                "فَأَنۢبَتْنَا فِيهَا حَبًّۭا",
                27,
                80
            ],
            [
                "وَعِنَبًۭا وَقَضْبًۭا",
                28,
                80
            ],
            [
                "وَزَيْتُونًۭا وَنَخْلًۭا",
                29,
                80
            ],
            [
                "وَحَدَآئِقَ غُلْبًۭا",
                30,
                80
            ],
            [
                "وَفَٰكِهَةًۭ وَأَبًّۭا",
                31,
                80
            ],
            [
                "مَّتَٰعًۭا لَّكُمْ وَلِأَنْعَٰمِكُمْ",
                32,
                80
            ],
            [
                "فَإِذَا جَآءَتِ ٱلصَّآخَّةُ",
                33,
                80
            ],
            [
                "يَوْمَ يَفِرُّ ٱلْمَرْءُ مِنْ أَخِيهِ",
                34,
                80
            ],
            [
                "وَأُمِّهِۦ وَأَبِيهِ",
                35,
                80
            ],
            [
                "وَصَٰحِبَتِهِۦ وَبَنِيهِ",
                36,
                80
            ],
            [
                "لِكُلِّ ٱمْرِئٍۢ مِّنْهُمْ يَوْمَئِذٍۢ شَأْنٌۭ يُغْنِيهِ",
                37,
                80
            ],
            [
                "وُجُوهٌۭ يَوْمَئِذٍۢ مُّسْفِرَةٌۭ",
                38,
                80
            ],
            [
                "ضَاحِكَةٌۭ مُّسْتَبْشِرَةٌۭ",
                39,
                80
            ],
            [
                "وَوُجُوهٌۭ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌۭ",
                40,
                80
            ],
            [
                "تَرْهَقُهَا قَتَرَةٌ",
                41,
                80
            ],
            [
                "أُو۟لَٰٓئِكَ هُمُ ٱلْكَفَرَةُ ٱلْفَجَرَةُ",
                42,
                80
            ],
            [
                " إِذَا ٱلشَّمْسُ كُوِّرَتْ",
                1,
                81
            ],
            [
                "وَإِذَا ٱلنُّجُومُ ٱنكَدَرَتْ",
                2,
                81
            ],
            [
                "وَإِذَا ٱلْجِبَالُ سُيِّرَتْ",
                3,
                81
            ],
            [
                "وَإِذَا ٱلْعِشَارُ عُطِّلَتْ",
                4,
                81
            ],
            [
                "وَإِذَا ٱلْوُحُوشُ حُشِرَتْ",
                5,
                81
            ],
            [
                "وَإِذَا ٱلْبِحَارُ سُجِّرَتْ",
                6,
                81
            ],
            [
                "وَإِذَا ٱلنُّفُوسُ زُوِّجَتْ",
                7,
                81
            ],
            [
                "وَإِذَا ٱلْمَوْءُۥدَةُ سُئِلَتْ",
                8,
                81
            ],
            [
                "بِأَىِّ ذَنۢبٍۢ قُتِلَتْ",
                9,
                81
            ],
            [
                "وَإِذَا ٱلصُّحُفُ نُشِرَتْ",
                10,
                81
            ],
            [
                "وَإِذَا ٱلسَّمَآءُ كُشِطَتْ",
                11,
                81
            ],
            [
                "وَإِذَا ٱلْجَحِيمُ سُعِّرَتْ",
                12,
                81
            ],
            [
                "وَإِذَا ٱلْجَنَّةُ أُزْلِفَتْ",
                13,
                81
            ],
            [
                "عَلِمَتْ نَفْسٌۭ مَّآ أَحْضَرَتْ",
                14,
                81
            ],
            [
                "فَلَآ أُقْسِمُ بِٱلْخُنَّسِ",
                15,
                81
            ],
            [
                "ٱلْجَوَارِ ٱلْكُنَّسِ",
                16,
                81
            ],
            [
                "وَٱلَّيْلِ إِذَا عَسْعَسَ",
                17,
                81
            ],
            [
                "وَٱلصُّبْحِ إِذَا تَنَفَّسَ",
                18,
                81
            ],
            [
                "إِنَّهُۥ لَقَوْلُ رَسُولٍۢ كَرِيمٍۢ",
                19,
                81
            ],
            [
                "ذِى قُوَّةٍ عِندَ ذِى ٱلْعَرْشِ مَكِينٍۢ",
                20,
                81
            ],
            [
                "مُّطَاعٍۢ ثَمَّ أَمِينٍۢ",
                21,
                81
            ],
            [
                "وَمَا صَاحِبُكُم بِمَجْنُونٍۢ",
                22,
                81
            ],
            [
                "وَلَقَدْ رَءَاهُ بِٱلْأُفُقِ ٱلْمُبِينِ",
                23,
                81
            ],
            [
                "وَمَا هُوَ عَلَى ٱلْغَيْبِ بِضَنِينٍۢ",
                24,
                81
            ],
            [
                "وَمَا هُوَ بِقَوْلِ شَيْطَٰنٍۢ رَّجِيمٍۢ",
                25,
                81
            ],
            [
                "فَأَيْنَ تَذْهَبُونَ",
                26,
                81
            ],
            [
                "إِنْ هُوَ إِلَّا ذِكْرٌۭ لِّلْعَٰلَمِينَ",
                27,
                81
            ],
            [
                "لِمَن شَآءَ مِنكُمْ أَن يَسْتَقِيمَ",
                28,
                81
            ],
            [
                "وَمَا تَشَآءُونَ إِلَّآ أَن يَشَآءَ ٱللَّهُ رَبُّ ٱلْعَٰلَمِينَ",
                29,
                81
            ],
            [
                " إِذَا ٱلسَّمَآءُ ٱنفَطَرَتْ",
                1,
                82
            ],
            [
                "وَإِذَا ٱلْكَوَاكِبُ ٱنتَثَرَتْ",
                2,
                82
            ],
            [
                "وَإِذَا ٱلْبِحَارُ فُجِّرَتْ",
                3,
                82
            ],
            [
                "وَإِذَا ٱلْقُبُورُ بُعْثِرَتْ",
                4,
                82
            ],
            [
                "عَلِمَتْ نَفْسٌۭ مَّا قَدَّمَتْ وَأَخَّرَتْ",
                5,
                82
            ],
            [
                "يَٰٓأَيُّهَا ٱلْإِنسَٰنُ مَا غَرَّكَ بِرَبِّكَ ٱلْكَرِيمِ",
                6,
                82
            ],
            [
                "ٱلَّذِى خَلَقَكَ فَسَوَّىٰكَ فَعَدَلَكَ",
                7,
                82
            ],
            [
                "فِىٓ أَىِّ صُورَةٍۢ مَّا شَآءَ رَكَّبَكَ",
                8,
                82
            ],
            [
                "كَلَّا بَلْ تُكَذِّبُونَ بِٱلدِّينِ",
                9,
                82
            ],
            [
                "وَإِنَّ عَلَيْكُمْ لَحَٰفِظِينَ",
                10,
                82
            ],
            [
                "كِرَامًۭا كَٰتِبِينَ",
                11,
                82
            ],
            [
                "يَعْلَمُونَ مَا تَفْعَلُونَ",
                12,
                82
            ],
            [
                "إِنَّ ٱلْأَبْرَارَ لَفِى نَعِيمٍۢ",
                13,
                82
            ],
            [
                "وَإِنَّ ٱلْفُجَّارَ لَفِى جَحِيمٍۢ",
                14,
                82
            ],
            [
                "يَصْلَوْنَهَا يَوْمَ ٱلدِّينِ",
                15,
                82
            ],
            [
                "وَمَا هُمْ عَنْهَا بِغَآئِبِينَ",
                16,
                82
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا يَوْمُ ٱلدِّينِ",
                17,
                82
            ],
            [
                "ثُمَّ مَآ أَدْرَىٰكَ مَا يَوْمُ ٱلدِّينِ",
                18,
                82
            ],
            [
                "يَوْمَ لَا تَمْلِكُ نَفْسٌۭ لِّنَفْسٍۢ شَيْـًۭٔا ۖ وَٱلْأَمْرُ يَوْمَئِذٍۢ لِّلَّهِ",
                19,
                82
            ],
            [
                " وَيْلٌۭ لِّلْمُطَفِّفِينَ",
                1,
                83
            ],
            [
                "ٱلَّذِينَ إِذَا ٱكْتَالُوا۟ عَلَى ٱلنَّاسِ يَسْتَوْفُونَ",
                2,
                83
            ],
            [
                "وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ",
                3,
                83
            ],
            [
                "أَلَا يَظُنُّ أُو۟لَٰٓئِكَ أَنَّهُم مَّبْعُوثُونَ",
                4,
                83
            ],
            [
                "لِيَوْمٍ عَظِيمٍۢ",
                5,
                83
            ],
            [
                "يَوْمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلْعَٰلَمِينَ",
                6,
                83
            ],
            [
                "كَلَّآ إِنَّ كِتَٰبَ ٱلْفُجَّارِ لَفِى سِجِّينٍۢ",
                7,
                83
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا سِجِّينٌۭ",
                8,
                83
            ],
            [
                "كِتَٰبٌۭ مَّرْقُومٌۭ",
                9,
                83
            ],
            [
                "وَيْلٌۭ يَوْمَئِذٍۢ لِّلْمُكَذِّبِينَ",
                10,
                83
            ],
            [
                "ٱلَّذِينَ يُكَذِّبُونَ بِيَوْمِ ٱلدِّينِ",
                11,
                83
            ],
            [
                "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ",
                12,
                83
            ],
            [
                "إِذَا تُتْلَىٰ عَلَيْهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلْأَوَّلِينَ",
                13,
                83
            ],
            [
                "كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا۟ يَكْسِبُونَ",
                14,
                83
            ],
            [
                "كَلَّآ إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍۢ لَّمَحْجُوبُونَ",
                15,
                83
            ],
            [
                "ثُمَّ إِنَّهُمْ لَصَالُوا۟ ٱلْجَحِيمِ",
                16,
                83
            ],
            [
                "ثُمَّ يُقَالُ هَٰذَا ٱلَّذِى كُنتُم بِهِۦ تُكَذِّبُونَ",
                17,
                83
            ],
            [
                "كَلَّآ إِنَّ كِتَٰبَ ٱلْأَبْرَارِ لَفِى عِلِّيِّينَ",
                18,
                83
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا عِلِّيُّونَ",
                19,
                83
            ],
            [
                "كِتَٰبٌۭ مَّرْقُومٌۭ",
                20,
                83
            ],
            [
                "يَشْهَدُهُ ٱلْمُقَرَّبُونَ",
                21,
                83
            ],
            [
                "إِنَّ ٱلْأَبْرَارَ لَفِى نَعِيمٍ",
                22,
                83
            ],
            [
                "عَلَى ٱلْأَرَآئِكِ يَنظُرُونَ",
                23,
                83
            ],
            [
                "تَعْرِفُ فِى وُجُوهِهِمْ نَضْرَةَ ٱلنَّعِيمِ",
                24,
                83
            ],
            [
                "يُسْقَوْنَ مِن رَّحِيقٍۢ مَّخْتُومٍ",
                25,
                83
            ],
            [
                "خِتَٰمُهُۥ مِسْكٌۭ ۚ وَفِى ذَٰلِكَ فَلْيَتَنَافَسِ ٱلْمُتَنَٰفِسُونَ",
                26,
                83
            ],
            [
                "وَمِزَاجُهُۥ مِن تَسْنِيمٍ",
                27,
                83
            ],
            [
                "عَيْنًۭا يَشْرَبُ بِهَا ٱلْمُقَرَّبُونَ",
                28,
                83
            ],
            [
                "إِنَّ ٱلَّذِينَ أَجْرَمُوا۟ كَانُوا۟ مِنَ ٱلَّذِينَ ءَامَنُوا۟ يَضْحَكُونَ",
                29,
                83
            ],
            [
                "وَإِذَا مَرُّوا۟ بِهِمْ يَتَغَامَزُونَ",
                30,
                83
            ],
            [
                "وَإِذَا ٱنقَلَبُوٓا۟ إِلَىٰٓ أَهْلِهِمُ ٱنقَلَبُوا۟ فَكِهِينَ",
                31,
                83
            ],
            [
                "وَإِذَا رَأَوْهُمْ قَالُوٓا۟ إِنَّ هَٰٓؤُلَآءِ لَضَآلُّونَ",
                32,
                83
            ],
            [
                "وَمَآ أُرْسِلُوا۟ عَلَيْهِمْ حَٰفِظِينَ",
                33,
                83
            ],
            [
                "فَٱلْيَوْمَ ٱلَّذِينَ ءَامَنُوا۟ مِنَ ٱلْكُفَّارِ يَضْحَكُونَ",
                34,
                83
            ],
            [
                "عَلَى ٱلْأَرَآئِكِ يَنظُرُونَ",
                35,
                83
            ],
            [
                "هَلْ ثُوِّبَ ٱلْكُفَّارُ مَا كَانُوا۟ يَفْعَلُونَ",
                36,
                83
            ],
            [
                " إِذَا ٱلسَّمَآءُ ٱنشَقَّتْ",
                1,
                84
            ],
            [
                "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ",
                2,
                84
            ],
            [
                "وَإِذَا ٱلْأَرْضُ مُدَّتْ",
                3,
                84
            ],
            [
                "وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ",
                4,
                84
            ],
            [
                "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ",
                5,
                84
            ],
            [
                "يَٰٓأَيُّهَا ٱلْإِنسَٰنُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًۭا فَمُلَٰقِيهِ",
                6,
                84
            ],
            [
                "فَأَمَّا مَنْ أُوتِىَ كِتَٰبَهُۥ بِيَمِينِهِۦ",
                7,
                84
            ],
            [
                "فَسَوْفَ يُحَاسَبُ حِسَابًۭا يَسِيرًۭا",
                8,
                84
            ],
            [
                "وَيَنقَلِبُ إِلَىٰٓ أَهْلِهِۦ مَسْرُورًۭا",
                9,
                84
            ],
            [
                "وَأَمَّا مَنْ أُوتِىَ كِتَٰبَهُۥ وَرَآءَ ظَهْرِهِۦ",
                10,
                84
            ],
            [
                "فَسَوْفَ يَدْعُوا۟ ثُبُورًۭا",
                11,
                84
            ],
            [
                "وَيَصْلَىٰ سَعِيرًا",
                12,
                84
            ],
            [
                "إِنَّهُۥ كَانَ فِىٓ أَهْلِهِۦ مَسْرُورًا",
                13,
                84
            ],
            [
                "إِنَّهُۥ ظَنَّ أَن لَّن يَحُورَ",
                14,
                84
            ],
            [
                "بَلَىٰٓ إِنَّ رَبَّهُۥ كَانَ بِهِۦ بَصِيرًۭا",
                15,
                84
            ],
            [
                "فَلَآ أُقْسِمُ بِٱلشَّفَقِ",
                16,
                84
            ],
            [
                "وَٱلَّيْلِ وَمَا وَسَقَ",
                17,
                84
            ],
            [
                "وَٱلْقَمَرِ إِذَا ٱتَّسَقَ",
                18,
                84
            ],
            [
                "لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍۢ",
                19,
                84
            ],
            [
                "فَمَا لَهُمْ لَا يُؤْمِنُونَ",
                20,
                84
            ],
            [
                "وَإِذَا قُرِئَ عَلَيْهِمُ ٱلْقُرْءَانُ لَا يَسْجُدُونَ ۩",
                21,
                84
            ],
            [
                "بَلِ ٱلَّذِينَ كَفَرُوا۟ يُكَذِّبُونَ",
                22,
                84
            ],
            [
                "وَٱللَّهُ أَعْلَمُ بِمَا يُوعُونَ",
                23,
                84
            ],
            [
                "فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
                24,
                84
            ],
            [
                "إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍۭ",
                25,
                84
            ],
            [
                " وَٱلسَّمَآءِ ذَاتِ ٱلْبُرُوجِ",
                1,
                85
            ],
            [
                "وَٱلْيَوْمِ ٱلْمَوْعُودِ",
                2,
                85
            ],
            [
                "وَشَاهِدٍۢ وَمَشْهُودٍۢ",
                3,
                85
            ],
            [
                "قُتِلَ أَصْحَٰبُ ٱلْأُخْدُودِ",
                4,
                85
            ],
            [
                "ٱلنَّارِ ذَاتِ ٱلْوَقُودِ",
                5,
                85
            ],
            [
                "إِذْ هُمْ عَلَيْهَا قُعُودٌۭ",
                6,
                85
            ],
            [
                "وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِٱلْمُؤْمِنِينَ شُهُودٌۭ",
                7,
                85
            ],
            [
                "وَمَا نَقَمُوا۟ مِنْهُمْ إِلَّآ أَن يُؤْمِنُوا۟ بِٱللَّهِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
                8,
                85
            ],
            [
                "ٱلَّذِى لَهُۥ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضِ ۚ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍۢ شَهِيدٌ",
                9,
                85
            ],
            [
                "إِنَّ ٱلَّذِينَ فَتَنُوا۟ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ ثُمَّ لَمْ يَتُوبُوا۟ فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ ٱلْحَرِيقِ",
                10,
                85
            ],
            [
                "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ لَهُمْ جَنَّٰتٌۭ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْكَبِيرُ",
                11,
                85
            ],
            [
                "إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ",
                12,
                85
            ],
            [
                "إِنَّهُۥ هُوَ يُبْدِئُ وَيُعِيدُ",
                13,
                85
            ],
            [
                "وَهُوَ ٱلْغَفُورُ ٱلْوَدُودُ",
                14,
                85
            ],
            [
                "ذُو ٱلْعَرْشِ ٱلْمَجِيدُ",
                15,
                85
            ],
            [
                "فَعَّالٌۭ لِّمَا يُرِيدُ",
                16,
                85
            ],
            [
                "هَلْ أَتَىٰكَ حَدِيثُ ٱلْجُنُودِ",
                17,
                85
            ],
            [
                "فِرْعَوْنَ وَثَمُودَ",
                18,
                85
            ],
            [
                "بَلِ ٱلَّذِينَ كَفَرُوا۟ فِى تَكْذِيبٍۢ",
                19,
                85
            ],
            [
                "وَٱللَّهُ مِن وَرَآئِهِم مُّحِيطٌۢ",
                20,
                85
            ],
            [
                "بَلْ هُوَ قُرْءَانٌۭ مَّجِيدٌۭ",
                21,
                85
            ],
            [
                "فِى لَوْحٍۢ مَّحْفُوظٍۭ",
                22,
                85
            ],
            [
                " وَٱلسَّمَآءِ وَٱلطَّارِقِ",
                1,
                86
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا ٱلطَّارِقُ",
                2,
                86
            ],
            [
                "ٱلنَّجْمُ ٱلثَّاقِبُ",
                3,
                86
            ],
            [
                "إِن كُلُّ نَفْسٍۢ لَّمَّا عَلَيْهَا حَافِظٌۭ",
                4,
                86
            ],
            [
                "فَلْيَنظُرِ ٱلْإِنسَٰنُ مِمَّ خُلِقَ",
                5,
                86
            ],
            [
                "خُلِقَ مِن مَّآءٍۢ دَافِقٍۢ",
                6,
                86
            ],
            [
                "يَخْرُجُ مِنۢ بَيْنِ ٱلصُّلْبِ وَٱلتَّرَآئِبِ",
                7,
                86
            ],
            [
                "إِنَّهُۥ عَلَىٰ رَجْعِهِۦ لَقَادِرٌۭ",
                8,
                86
            ],
            [
                "يَوْمَ تُبْلَى ٱلسَّرَآئِرُ",
                9,
                86
            ],
            [
                "فَمَا لَهُۥ مِن قُوَّةٍۢ وَلَا نَاصِرٍۢ",
                10,
                86
            ],
            [
                "وَٱلسَّمَآءِ ذَاتِ ٱلرَّجْعِ",
                11,
                86
            ],
            [
                "وَٱلْأَرْضِ ذَاتِ ٱلصَّدْعِ",
                12,
                86
            ],
            [
                "إِنَّهُۥ لَقَوْلٌۭ فَصْلٌۭ",
                13,
                86
            ],
            [
                "وَمَا هُوَ بِٱلْهَزْلِ",
                14,
                86
            ],
            [
                "إِنَّهُمْ يَكِيدُونَ كَيْدًۭا",
                15,
                86
            ],
            [
                "وَأَكِيدُ كَيْدًۭا",
                16,
                86
            ],
            [
                "فَمَهِّلِ ٱلْكَٰفِرِينَ أَمْهِلْهُمْ رُوَيْدًۢا",
                17,
                86
            ],
            [
                " سَبِّحِ ٱسْمَ رَبِّكَ ٱلْأَعْلَى",
                1,
                87
            ],
            [
                "ٱلَّذِى خَلَقَ فَسَوَّىٰ",
                2,
                87
            ],
            [
                "وَٱلَّذِى قَدَّرَ فَهَدَىٰ",
                3,
                87
            ],
            [
                "وَٱلَّذِىٓ أَخْرَجَ ٱلْمَرْعَىٰ",
                4,
                87
            ],
            [
                "فَجَعَلَهُۥ غُثَآءً أَحْوَىٰ",
                5,
                87
            ],
            [
                "سَنُقْرِئُكَ فَلَا تَنسَىٰٓ",
                6,
                87
            ],
            [
                "إِلَّا مَا شَآءَ ٱللَّهُ ۚ إِنَّهُۥ يَعْلَمُ ٱلْجَهْرَ وَمَا يَخْفَىٰ",
                7,
                87
            ],
            [
                "وَنُيَسِّرُكَ لِلْيُسْرَىٰ",
                8,
                87
            ],
            [
                "فَذَكِّرْ إِن نَّفَعَتِ ٱلذِّكْرَىٰ",
                9,
                87
            ],
            [
                "سَيَذَّكَّرُ مَن يَخْشَىٰ",
                10,
                87
            ],
            [
                "وَيَتَجَنَّبُهَا ٱلْأَشْقَى",
                11,
                87
            ],
            [
                "ٱلَّذِى يَصْلَى ٱلنَّارَ ٱلْكُبْرَىٰ",
                12,
                87
            ],
            [
                "ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ",
                13,
                87
            ],
            [
                "قَدْ أَفْلَحَ مَن تَزَكَّىٰ",
                14,
                87
            ],
            [
                "وَذَكَرَ ٱسْمَ رَبِّهِۦ فَصَلَّىٰ",
                15,
                87
            ],
            [
                "بَلْ تُؤْثِرُونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا",
                16,
                87
            ],
            [
                "وَٱلْءَاخِرَةُ خَيْرٌۭ وَأَبْقَىٰٓ",
                17,
                87
            ],
            [
                "إِنَّ هَٰذَا لَفِى ٱلصُّحُفِ ٱلْأُولَىٰ",
                18,
                87
            ],
            [
                "صُحُفِ إِبْرَٰهِيمَ وَمُوسَىٰ",
                19,
                87
            ],
            [
                " هَلْ أَتَىٰكَ حَدِيثُ ٱلْغَٰشِيَةِ",
                1,
                88
            ],
            [
                "وُجُوهٌۭ يَوْمَئِذٍ خَٰشِعَةٌ",
                2,
                88
            ],
            [
                "عَامِلَةٌۭ نَّاصِبَةٌۭ",
                3,
                88
            ],
            [
                "تَصْلَىٰ نَارًا حَامِيَةًۭ",
                4,
                88
            ],
            [
                "تُسْقَىٰ مِنْ عَيْنٍ ءَانِيَةٍۢ",
                5,
                88
            ],
            [
                "لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍۢ",
                6,
                88
            ],
            [
                "لَّا يُسْمِنُ وَلَا يُغْنِى مِن جُوعٍۢ",
                7,
                88
            ],
            [
                "وُجُوهٌۭ يَوْمَئِذٍۢ نَّاعِمَةٌۭ",
                8,
                88
            ],
            [
                "لِّسَعْيِهَا رَاضِيَةٌۭ",
                9,
                88
            ],
            [
                "فِى جَنَّةٍ عَالِيَةٍۢ",
                10,
                88
            ],
            [
                "لَّا تَسْمَعُ فِيهَا لَٰغِيَةًۭ",
                11,
                88
            ],
            [
                "فِيهَا عَيْنٌۭ جَارِيَةٌۭ",
                12,
                88
            ],
            [
                "فِيهَا سُرُرٌۭ مَّرْفُوعَةٌۭ",
                13,
                88
            ],
            [
                "وَأَكْوَابٌۭ مَّوْضُوعَةٌۭ",
                14,
                88
            ],
            [
                "وَنَمَارِقُ مَصْفُوفَةٌۭ",
                15,
                88
            ],
            [
                "وَزَرَابِىُّ مَبْثُوثَةٌ",
                16,
                88
            ],
            [
                "أَفَلَا يَنظُرُونَ إِلَى ٱلْإِبِلِ كَيْفَ خُلِقَتْ",
                17,
                88
            ],
            [
                "وَإِلَى ٱلسَّمَآءِ كَيْفَ رُفِعَتْ",
                18,
                88
            ],
            [
                "وَإِلَى ٱلْجِبَالِ كَيْفَ نُصِبَتْ",
                19,
                88
            ],
            [
                "وَإِلَى ٱلْأَرْضِ كَيْفَ سُطِحَتْ",
                20,
                88
            ],
            [
                "فَذَكِّرْ إِنَّمَآ أَنتَ مُذَكِّرٌۭ",
                21,
                88
            ],
            [
                "لَّسْتَ عَلَيْهِم بِمُصَيْطِرٍ",
                22,
                88
            ],
            [
                "إِلَّا مَن تَوَلَّىٰ وَكَفَرَ",
                23,
                88
            ],
            [
                "فَيُعَذِّبُهُ ٱللَّهُ ٱلْعَذَابَ ٱلْأَكْبَرَ",
                24,
                88
            ],
            [
                "إِنَّ إِلَيْنَآ إِيَابَهُمْ",
                25,
                88
            ],
            [
                "ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُم",
                26,
                88
            ],
            [
                " وَٱلْفَجْرِ",
                1,
                89
            ],
            [
                "وَلَيَالٍ عَشْرٍۢ",
                2,
                89
            ],
            [
                "وَٱلشَّفْعِ وَٱلْوَتْرِ",
                3,
                89
            ],
            [
                "وَٱلَّيْلِ إِذَا يَسْرِ",
                4,
                89
            ],
            [
                "هَلْ فِى ذَٰلِكَ قَسَمٌۭ لِّذِى حِجْرٍ",
                5,
                89
            ],
            [
                "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ",
                6,
                89
            ],
            [
                "إِرَمَ ذَاتِ ٱلْعِمَادِ",
                7,
                89
            ],
            [
                "ٱلَّتِى لَمْ يُخْلَقْ مِثْلُهَا فِى ٱلْبِلَٰدِ",
                8,
                89
            ],
            [
                "وَثَمُودَ ٱلَّذِينَ جَابُوا۟ ٱلصَّخْرَ بِٱلْوَادِ",
                9,
                89
            ],
            [
                "وَفِرْعَوْنَ ذِى ٱلْأَوْتَادِ",
                10,
                89
            ],
            [
                "ٱلَّذِينَ طَغَوْا۟ فِى ٱلْبِلَٰدِ",
                11,
                89
            ],
            [
                "فَأَكْثَرُوا۟ فِيهَا ٱلْفَسَادَ",
                12,
                89
            ],
            [
                "فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ",
                13,
                89
            ],
            [
                "إِنَّ رَبَّكَ لَبِٱلْمِرْصَادِ",
                14,
                89
            ],
            [
                "فَأَمَّا ٱلْإِنسَٰنُ إِذَا مَا ٱبْتَلَىٰهُ رَبُّهُۥ فَأَكْرَمَهُۥ وَنَعَّمَهُۥ فَيَقُولُ رَبِّىٓ أَكْرَمَنِ",
                15,
                89
            ],
            [
                "وَأَمَّآ إِذَا مَا ٱبْتَلَىٰهُ فَقَدَرَ عَلَيْهِ رِزْقَهُۥ فَيَقُولُ رَبِّىٓ أَهَٰنَنِ",
                16,
                89
            ],
            [
                "كَلَّا ۖ بَل لَّا تُكْرِمُونَ ٱلْيَتِيمَ",
                17,
                89
            ],
            [
                "وَلَا تَحَٰٓضُّونَ عَلَىٰ طَعَامِ ٱلْمِسْكِينِ",
                18,
                89
            ],
            [
                "وَتَأْكُلُونَ ٱلتُّرَاثَ أَكْلًۭا لَّمًّۭا",
                19,
                89
            ],
            [
                "وَتُحِبُّونَ ٱلْمَالَ حُبًّۭا جَمًّۭا",
                20,
                89
            ],
            [
                "كَلَّآ إِذَا دُكَّتِ ٱلْأَرْضُ دَكًّۭا دَكًّۭا",
                21,
                89
            ],
            [
                "وَجَآءَ رَبُّكَ وَٱلْمَلَكُ صَفًّۭا صَفًّۭا",
                22,
                89
            ],
            [
                "وَجِا۟ىٓءَ يَوْمَئِذٍۭ بِجَهَنَّمَ ۚ يَوْمَئِذٍۢ يَتَذَكَّرُ ٱلْإِنسَٰنُ وَأَنَّىٰ لَهُ ٱلذِّكْرَىٰ",
                23,
                89
            ],
            [
                "يَقُولُ يَٰلَيْتَنِى قَدَّمْتُ لِحَيَاتِى",
                24,
                89
            ],
            [
                "فَيَوْمَئِذٍۢ لَّا يُعَذِّبُ عَذَابَهُۥٓ أَحَدٌۭ",
                25,
                89
            ],
            [
                "وَلَا يُوثِقُ وَثَاقَهُۥٓ أَحَدٌۭ",
                26,
                89
            ],
            [
                "يَٰٓأَيَّتُهَا ٱلنَّفْسُ ٱلْمُطْمَئِنَّةُ",
                27,
                89
            ],
            [
                "ٱرْجِعِىٓ إِلَىٰ رَبِّكِ رَاضِيَةًۭ مَّرْضِيَّةًۭ",
                28,
                89
            ],
            [
                "فَٱدْخُلِى فِى عِبَٰدِى",
                29,
                89
            ],
            [
                "وَٱدْخُلِى جَنَّتِى",
                30,
                89
            ],
            [
                " لَآ أُقْسِمُ بِهَٰذَا ٱلْبَلَدِ",
                1,
                90
            ],
            [
                "وَأَنتَ حِلٌّۢ بِهَٰذَا ٱلْبَلَدِ",
                2,
                90
            ],
            [
                "وَوَالِدٍۢ وَمَا وَلَدَ",
                3,
                90
            ],
            [
                "لَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ فِى كَبَدٍ",
                4,
                90
            ],
            [
                "أَيَحْسَبُ أَن لَّن يَقْدِرَ عَلَيْهِ أَحَدٌۭ",
                5,
                90
            ],
            [
                "يَقُولُ أَهْلَكْتُ مَالًۭا لُّبَدًا",
                6,
                90
            ],
            [
                "أَيَحْسَبُ أَن لَّمْ يَرَهُۥٓ أَحَدٌ",
                7,
                90
            ],
            [
                "أَلَمْ نَجْعَل لَّهُۥ عَيْنَيْنِ",
                8,
                90
            ],
            [
                "وَلِسَانًۭا وَشَفَتَيْنِ",
                9,
                90
            ],
            [
                "وَهَدَيْنَٰهُ ٱلنَّجْدَيْنِ",
                10,
                90
            ],
            [
                "فَلَا ٱقْتَحَمَ ٱلْعَقَبَةَ",
                11,
                90
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا ٱلْعَقَبَةُ",
                12,
                90
            ],
            [
                "فَكُّ رَقَبَةٍ",
                13,
                90
            ],
            [
                "أَوْ إِطْعَٰمٌۭ فِى يَوْمٍۢ ذِى مَسْغَبَةٍۢ",
                14,
                90
            ],
            [
                "يَتِيمًۭا ذَا مَقْرَبَةٍ",
                15,
                90
            ],
            [
                "أَوْ مِسْكِينًۭا ذَا مَتْرَبَةٍۢ",
                16,
                90
            ],
            [
                "ثُمَّ كَانَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ وَتَوَاصَوْا۟ بِٱلصَّبْرِ وَتَوَاصَوْا۟ بِٱلْمَرْحَمَةِ",
                17,
                90
            ],
            [
                "أُو۟لَٰٓئِكَ أَصْحَٰبُ ٱلْمَيْمَنَةِ",
                18,
                90
            ],
            [
                "وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَٰتِنَا هُمْ أَصْحَٰبُ ٱلْمَشْـَٔمَةِ",
                19,
                90
            ],
            [
                "عَلَيْهِمْ نَارٌۭ مُّؤْصَدَةٌۢ",
                20,
                90
            ],
            [
                " وَٱلشَّمْسِ وَضُحَىٰهَا",
                1,
                91
            ],
            [
                "وَٱلْقَمَرِ إِذَا تَلَىٰهَا",
                2,
                91
            ],
            [
                "وَٱلنَّهَارِ إِذَا جَلَّىٰهَا",
                3,
                91
            ],
            [
                "وَٱلَّيْلِ إِذَا يَغْشَىٰهَا",
                4,
                91
            ],
            [
                "وَٱلسَّمَآءِ وَمَا بَنَىٰهَا",
                5,
                91
            ],
            [
                "وَٱلْأَرْضِ وَمَا طَحَىٰهَا",
                6,
                91
            ],
            [
                "وَنَفْسٍۢ وَمَا سَوَّىٰهَا",
                7,
                91
            ],
            [
                "فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَىٰهَا",
                8,
                91
            ],
            [
                "قَدْ أَفْلَحَ مَن زَكَّىٰهَا",
                9,
                91
            ],
            [
                "وَقَدْ خَابَ مَن دَسَّىٰهَا",
                10,
                91
            ],
            [
                "كَذَّبَتْ ثَمُودُ بِطَغْوَىٰهَآ",
                11,
                91
            ],
            [
                "إِذِ ٱنۢبَعَثَ أَشْقَىٰهَا",
                12,
                91
            ],
            [
                "فَقَالَ لَهُمْ رَسُولُ ٱللَّهِ نَاقَةَ ٱللَّهِ وَسُقْيَٰهَا",
                13,
                91
            ],
            [
                "فَكَذَّبُوهُ فَعَقَرُوهَا فَدَمْدَمَ عَلَيْهِمْ رَبُّهُم بِذَنۢبِهِمْ فَسَوَّىٰهَا",
                14,
                91
            ],
            [
                "وَلَا يَخَافُ عُقْبَٰهَا",
                15,
                91
            ],
            [
                " وَٱلَّيْلِ إِذَا يَغْشَىٰ",
                1,
                92
            ],
            [
                "وَٱلنَّهَارِ إِذَا تَجَلَّىٰ",
                2,
                92
            ],
            [
                "وَمَا خَلَقَ ٱلذَّكَرَ وَٱلْأُنثَىٰٓ",
                3,
                92
            ],
            [
                "إِنَّ سَعْيَكُمْ لَشَتَّىٰ",
                4,
                92
            ],
            [
                "فَأَمَّا مَنْ أَعْطَىٰ وَٱتَّقَىٰ",
                5,
                92
            ],
            [
                "وَصَدَّقَ بِٱلْحُسْنَىٰ",
                6,
                92
            ],
            [
                "فَسَنُيَسِّرُهُۥ لِلْيُسْرَىٰ",
                7,
                92
            ],
            [
                "وَأَمَّا مَنۢ بَخِلَ وَٱسْتَغْنَىٰ",
                8,
                92
            ],
            [
                "وَكَذَّبَ بِٱلْحُسْنَىٰ",
                9,
                92
            ],
            [
                "فَسَنُيَسِّرُهُۥ لِلْعُسْرَىٰ",
                10,
                92
            ],
            [
                "وَمَا يُغْنِى عَنْهُ مَالُهُۥٓ إِذَا تَرَدَّىٰٓ",
                11,
                92
            ],
            [
                "إِنَّ عَلَيْنَا لَلْهُدَىٰ",
                12,
                92
            ],
            [
                "وَإِنَّ لَنَا لَلْءَاخِرَةَ وَٱلْأُولَىٰ",
                13,
                92
            ],
            [
                "فَأَنذَرْتُكُمْ نَارًۭا تَلَظَّىٰ",
                14,
                92
            ],
            [
                "لَا يَصْلَىٰهَآ إِلَّا ٱلْأَشْقَى",
                15,
                92
            ],
            [
                "ٱلَّذِى كَذَّبَ وَتَوَلَّىٰ",
                16,
                92
            ],
            [
                "وَسَيُجَنَّبُهَا ٱلْأَتْقَى",
                17,
                92
            ],
            [
                "ٱلَّذِى يُؤْتِى مَالَهُۥ يَتَزَكَّىٰ",
                18,
                92
            ],
            [
                "وَمَا لِأَحَدٍ عِندَهُۥ مِن نِّعْمَةٍۢ تُجْزَىٰٓ",
                19,
                92
            ],
            [
                "إِلَّا ٱبْتِغَآءَ وَجْهِ رَبِّهِ ٱلْأَعْلَىٰ",
                20,
                92
            ],
            [
                "وَلَسَوْفَ يَرْضَىٰ",
                21,
                92
            ],
            [
                " وَٱلضُّحَىٰ",
                1,
                93
            ],
            [
                "وَٱلَّيْلِ إِذَا سَجَىٰ",
                2,
                93
            ],
            [
                "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
                3,
                93
            ],
            [
                "وَلَلْءَاخِرَةُ خَيْرٌۭ لَّكَ مِنَ ٱلْأُولَىٰ",
                4,
                93
            ],
            [
                "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰٓ",
                5,
                93
            ],
            [
                "أَلَمْ يَجِدْكَ يَتِيمًۭا فَـَٔاوَىٰ",
                6,
                93
            ],
            [
                "وَوَجَدَكَ ضَآلًّۭا فَهَدَىٰ",
                7,
                93
            ],
            [
                "وَوَجَدَكَ عَآئِلًۭا فَأَغْنَىٰ",
                8,
                93
            ],
            [
                "فَأَمَّا ٱلْيَتِيمَ فَلَا تَقْهَرْ",
                9,
                93
            ],
            [
                "وَأَمَّا ٱلسَّآئِلَ فَلَا تَنْهَرْ",
                10,
                93
            ],
            [
                "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
                11,
                93
            ],
            [
                " أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
                1,
                94
            ],
            [
                "وَوَضَعْنَا عَنكَ وِزْرَكَ",
                2,
                94
            ],
            [
                "ٱلَّذِىٓ أَنقَضَ ظَهْرَكَ",
                3,
                94
            ],
            [
                "وَرَفَعْنَا لَكَ ذِكْرَكَ",
                4,
                94
            ],
            [
                "فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا",
                5,
                94
            ],
            [
                "إِنَّ مَعَ ٱلْعُسْرِ يُسْرًۭا",
                6,
                94
            ],
            [
                "فَإِذَا فَرَغْتَ فَٱنصَبْ",
                7,
                94
            ],
            [
                "وَإِلَىٰ رَبِّكَ فَٱرْغَب",
                8,
                94
            ],
            [
                "بِّسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ وَٱلتِّينِ وَٱلزَّيْتُونِ",
                1,
                95
            ],
            [
                "وَطُورِ سِينِينَ",
                2,
                95
            ],
            [
                "وَهَٰذَا ٱلْبَلَدِ ٱلْأَمِينِ",
                3,
                95
            ],
            [
                "لَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ فِىٓ أَحْسَنِ تَقْوِيمٍۢ",
                4,
                95
            ],
            [
                "ثُمَّ رَدَدْنَٰهُ أَسْفَلَ سَٰفِلِينَ",
                5,
                95
            ],
            [
                "إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍۢ",
                6,
                95
            ],
            [
                "فَمَا يُكَذِّبُكَ بَعْدُ بِٱلدِّينِ",
                7,
                95
            ],
            [
                "أَلَيْسَ ٱللَّهُ بِأَحْكَمِ ٱلْحَٰكِمِينَ",
                8,
                95
            ],
            [
                " ٱقْرَأْ بِٱسْمِ رَبِّكَ ٱلَّذِى خَلَقَ",
                1,
                96
            ],
            [
                "خَلَقَ ٱلْإِنسَٰنَ مِنْ عَلَقٍ",
                2,
                96
            ],
            [
                "ٱقْرَأْ وَرَبُّكَ ٱلْأَكْرَمُ",
                3,
                96
            ],
            [
                "ٱلَّذِى عَلَّمَ بِٱلْقَلَمِ",
                4,
                96
            ],
            [
                "عَلَّمَ ٱلْإِنسَٰنَ مَا لَمْ يَعْلَمْ",
                5,
                96
            ],
            [
                "كَلَّآ إِنَّ ٱلْإِنسَٰنَ لَيَطْغَىٰٓ",
                6,
                96
            ],
            [
                "أَن رَّءَاهُ ٱسْتَغْنَىٰٓ",
                7,
                96
            ],
            [
                "إِنَّ إِلَىٰ رَبِّكَ ٱلرُّجْعَىٰٓ",
                8,
                96
            ],
            [
                "أَرَءَيْتَ ٱلَّذِى يَنْهَىٰ",
                9,
                96
            ],
            [
                "عَبْدًا إِذَا صَلَّىٰٓ",
                10,
                96
            ],
            [
                "أَرَءَيْتَ إِن كَانَ عَلَى ٱلْهُدَىٰٓ",
                11,
                96
            ],
            [
                "أَوْ أَمَرَ بِٱلتَّقْوَىٰٓ",
                12,
                96
            ],
            [
                "أَرَءَيْتَ إِن كَذَّبَ وَتَوَلَّىٰٓ",
                13,
                96
            ],
            [
                "أَلَمْ يَعْلَم بِأَنَّ ٱللَّهَ يَرَىٰ",
                14,
                96
            ],
            [
                "كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًۢا بِٱلنَّاصِيَةِ",
                15,
                96
            ],
            [
                "نَاصِيَةٍۢ كَٰذِبَةٍ خَاطِئَةٍۢ",
                16,
                96
            ],
            [
                "فَلْيَدْعُ نَادِيَهُۥ",
                17,
                96
            ],
            [
                "سَنَدْعُ ٱلزَّبَانِيَةَ",
                18,
                96
            ],
            [
                "كَلَّا لَا تُطِعْهُ وَٱسْجُدْ وَٱقْتَرِب ۩",
                19,
                96
            ],
            [
                "بِّسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ إِنَّآ أَنزَلْنَٰهُ فِى لَيْلَةِ ٱلْقَدْرِ",
                1,
                97
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا لَيْلَةُ ٱلْقَدْرِ",
                2,
                97
            ],
            [
                "لَيْلَةُ ٱلْقَدْرِ خَيْرٌۭ مِّنْ أَلْفِ شَهْرٍۢ",
                3,
                97
            ],
            [
                "تَنَزَّلُ ٱلْمَلَٰٓئِكَةُ وَٱلرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍۢ",
                4,
                97
            ],
            [
                "سَلَٰمٌ هِىَ حَتَّىٰ مَطْلَعِ ٱلْفَجْرِ",
                5,
                97
            ],
            [
                " لَمْ يَكُنِ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَٱلْمُشْرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ ٱلْبَيِّنَةُ",
                1,
                98
            ],
            [
                "رَسُولٌۭ مِّنَ ٱللَّهِ يَتْلُوا۟ صُحُفًۭا مُّطَهَّرَةًۭ",
                2,
                98
            ],
            [
                "فِيهَا كُتُبٌۭ قَيِّمَةٌۭ",
                3,
                98
            ],
            [
                "وَمَا تَفَرَّقَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ إِلَّا مِنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَةُ",
                4,
                98
            ],
            [
                "وَمَآ أُمِرُوٓا۟ إِلَّا لِيَعْبُدُوا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ وَيُقِيمُوا۟ ٱلصَّلَوٰةَ وَيُؤْتُوا۟ ٱلزَّكَوٰةَ ۚ وَذَٰلِكَ دِينُ ٱلْقَيِّمَةِ",
                5,
                98
            ],
            [
                "إِنَّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَٱلْمُشْرِكِينَ فِى نَارِ جَهَنَّمَ خَٰلِدِينَ فِيهَآ ۚ أُو۟لَٰٓئِكَ هُمْ شَرُّ ٱلْبَرِيَّةِ",
                6,
                98
            ],
            [
                "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ هُمْ خَيْرُ ٱلْبَرِيَّةِ",
                7,
                98
            ],
            [
                "جَزَآؤُهُمْ عِندَ رَبِّهِمْ جَنَّٰتُ عَدْنٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًۭا ۖ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِىَ رَبَّهُۥ",
                8,
                98
            ],
            [
                " إِذَا زُلْزِلَتِ ٱلْأَرْضُ زِلْزَالَهَا",
                1,
                99
            ],
            [
                "وَأَخْرَجَتِ ٱلْأَرْضُ أَثْقَالَهَا",
                2,
                99
            ],
            [
                "وَقَالَ ٱلْإِنسَٰنُ مَا لَهَا",
                3,
                99
            ],
            [
                "يَوْمَئِذٍۢ تُحَدِّثُ أَخْبَارَهَا",
                4,
                99
            ],
            [
                "بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا",
                5,
                99
            ],
            [
                "يَوْمَئِذٍۢ يَصْدُرُ ٱلنَّاسُ أَشْتَاتًۭا لِّيُرَوْا۟ أَعْمَٰلَهُمْ",
                6,
                99
            ],
            [
                "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًۭا يَرَهُۥ",
                7,
                99
            ],
            [
                "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍۢ شَرًّۭا يَرَهُۥ",
                8,
                99
            ],
            [
                " وَٱلْعَٰدِيَٰتِ ضَبْحًۭا",
                1,
                100
            ],
            [
                "فَٱلْمُورِيَٰتِ قَدْحًۭا",
                2,
                100
            ],
            [
                "فَٱلْمُغِيرَٰتِ صُبْحًۭا",
                3,
                100
            ],
            [
                "فَأَثَرْنَ بِهِۦ نَقْعًۭا",
                4,
                100
            ],
            [
                "فَوَسَطْنَ بِهِۦ جَمْعًا",
                5,
                100
            ],
            [
                "إِنَّ ٱلْإِنسَٰنَ لِرَبِّهِۦ لَكَنُودٌۭ",
                6,
                100
            ],
            [
                "وَإِنَّهُۥ عَلَىٰ ذَٰلِكَ لَشَهِيدٌۭ",
                7,
                100
            ],
            [
                "وَإِنَّهُۥ لِحُبِّ ٱلْخَيْرِ لَشَدِيدٌ",
                8,
                100
            ],
            [
                "۞ أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِى ٱلْقُبُورِ",
                9,
                100
            ],
            [
                "وَحُصِّلَ مَا فِى ٱلصُّدُورِ",
                10,
                100
            ],
            [
                "إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍۢ لَّخَبِيرٌۢ",
                11,
                100
            ],
            [
                " ٱلْقَارِعَةُ",
                1,
                101
            ],
            [
                "مَا ٱلْقَارِعَةُ",
                2,
                101
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا ٱلْقَارِعَةُ",
                3,
                101
            ],
            [
                "يَوْمَ يَكُونُ ٱلنَّاسُ كَٱلْفَرَاشِ ٱلْمَبْثُوثِ",
                4,
                101
            ],
            [
                "وَتَكُونُ ٱلْجِبَالُ كَٱلْعِهْنِ ٱلْمَنفُوشِ",
                5,
                101
            ],
            [
                "فَأَمَّا مَن ثَقُلَتْ مَوَٰزِينُهُۥ",
                6,
                101
            ],
            [
                "فَهُوَ فِى عِيشَةٍۢ رَّاضِيَةٍۢ",
                7,
                101
            ],
            [
                "وَأَمَّا مَنْ خَفَّتْ مَوَٰزِينُهُۥ",
                8,
                101
            ],
            [
                "فَأُمُّهُۥ هَاوِيَةٌۭ",
                9,
                101
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا هِيَهْ",
                10,
                101
            ],
            [
                "نَارٌ حَامِيَةٌۢ",
                11,
                101
            ],
            [
                " أَلْهَىٰكُمُ ٱلتَّكَاثُرُ",
                1,
                102
            ],
            [
                "حَتَّىٰ زُرْتُمُ ٱلْمَقَابِرَ",
                2,
                102
            ],
            [
                "كَلَّا سَوْفَ تَعْلَمُونَ",
                3,
                102
            ],
            [
                "ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ",
                4,
                102
            ],
            [
                "كَلَّا لَوْ تَعْلَمُونَ عِلْمَ ٱلْيَقِينِ",
                5,
                102
            ],
            [
                "لَتَرَوُنَّ ٱلْجَحِيمَ",
                6,
                102
            ],
            [
                "ثُمَّ لَتَرَوُنَّهَا عَيْنَ ٱلْيَقِينِ",
                7,
                102
            ],
            [
                "ثُمَّ لَتُسْـَٔلُنَّ يَوْمَئِذٍ عَنِ ٱلنَّعِيمِ",
                8,
                102
            ],
            [
                " وَٱلْعَصْرِ",
                1,
                103
            ],
            [
                "إِنَّ ٱلْإِنسَٰنَ لَفِى خُسْرٍ",
                2,
                103
            ],
            [
                "إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ وَتَوَاصَوْا۟ بِٱلْحَقِّ وَتَوَاصَوْا۟ بِٱلصَّبْرِ",
                3,
                103
            ],
            [
                " وَيْلٌۭ لِّكُلِّ هُمَزَةٍۢ لُّمَزَةٍ",
                1,
                104
            ],
            [
                "ٱلَّذِى جَمَعَ مَالًۭا وَعَدَّدَهُۥ",
                2,
                104
            ],
            [
                "يَحْسَبُ أَنَّ مَالَهُۥٓ أَخْلَدَهُۥ",
                3,
                104
            ],
            [
                "كَلَّا ۖ لَيُنۢبَذَنَّ فِى ٱلْحُطَمَةِ",
                4,
                104
            ],
            [
                "وَمَآ أَدْرَىٰكَ مَا ٱلْحُطَمَةُ",
                5,
                104
            ],
            [
                "نَارُ ٱللَّهِ ٱلْمُوقَدَةُ",
                6,
                104
            ],
            [
                "ٱلَّتِى تَطَّلِعُ عَلَى ٱلْأَفْـِٔدَةِ",
                7,
                104
            ],
            [
                "إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌۭ",
                8,
                104
            ],
            [
                "فِى عَمَدٍۢ مُّمَدَّدَةٍۭ",
                9,
                104
            ],
            [
                " أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَٰبِ ٱلْفِيلِ",
                1,
                105
            ],
            [
                "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِى تَضْلِيلٍۢ",
                2,
                105
            ],
            [
                "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ",
                3,
                105
            ],
            [
                "تَرْمِيهِم بِحِجَارَةٍۢ مِّن سِجِّيلٍۢ",
                4,
                105
            ],
            [
                "فَجَعَلَهُمْ كَعَصْفٍۢ مَّأْكُولٍۭ",
                5,
                105
            ],
            [
                " لِإِيلَٰفِ قُرَيْشٍ",
                1,
                106
            ],
            [
                "إِۦلَٰفِهِمْ رِحْلَةَ ٱلشِّتَآءِ وَٱلصَّيْفِ",
                2,
                106
            ],
            [
                "فَلْيَعْبُدُوا۟ رَبَّ هَٰذَا ٱلْبَيْتِ",
                3,
                106
            ],
            [
                "ٱلَّذِىٓ أَطْعَمَهُم مِّن جُوعٍۢ وَءَامَنَهُم مِّنْ خَوْفٍۭ",
                4,
                106
            ],
            [
                " أَرَءَيْتَ ٱلَّذِى يُكَذِّبُ بِٱلدِّينِ",
                1,
                107
            ],
            [
                "فَذَٰلِكَ ٱلَّذِى يَدُعُّ ٱلْيَتِيمَ",
                2,
                107
            ],
            [
                "وَلَا يَحُضُّ عَلَىٰ طَعَامِ ٱلْمِسْكِينِ",
                3,
                107
            ],
            [
                "فَوَيْلٌۭ لِّلْمُصَلِّينَ",
                4,
                107
            ],
            [
                "ٱلَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ",
                5,
                107
            ],
            [
                "ٱلَّذِينَ هُمْ يُرَآءُونَ",
                6,
                107
            ],
            [
                "وَيَمْنَعُونَ ٱلْمَاعُونَ",
                7,
                107
            ],
            [
                " إِنَّآ أَعْطَيْنَٰكَ ٱلْكَوْثَرَ",
                1,
                108
            ],
            [
                "فَصَلِّ لِرَبِّكَ وَٱنْحَرْ",
                2,
                108
            ],
            [
                "إِنَّ شَانِئَكَ هُوَ ٱلْأَبْتَرُ",
                3,
                108
            ],
            [
                " قُلْ يَٰٓأَيُّهَا ٱلْكَٰفِرُونَ",
                1,
                109
            ],
            [
                "لَآ أَعْبُدُ مَا تَعْبُدُونَ",
                2,
                109
            ],
            [
                "وَلَآ أَنتُمْ عَٰبِدُونَ مَآ أَعْبُدُ",
                3,
                109
            ],
            [
                "وَلَآ أَنَا۠ عَابِدٌۭ مَّا عَبَدتُّمْ",
                4,
                109
            ],
            [
                "وَلَآ أَنتُمْ عَٰبِدُونَ مَآ أَعْبُدُ",
                5,
                109
            ],
            [
                "لَكُمْ دِينُكُمْ وَلِىَ دِينِ",
                6,
                109
            ],
            [
                " إِذَا جَآءَ نَصْرُ ٱللَّهِ وَٱلْفَتْحُ",
                1,
                110
            ],
            [
                "وَرَأَيْتَ ٱلنَّاسَ يَدْخُلُونَ فِى دِينِ ٱللَّهِ أَفْوَاجًۭا",
                2,
                110
            ],
            [
                "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَٱسْتَغْفِرْهُ ۚ إِنَّهُۥ كَانَ تَوَّابًۢا",
                3,
                110
            ],
            [
                " تَبَّتْ يَدَآ أَبِى لَهَبٍۢ وَتَبَّ",
                1,
                111
            ],
            [
                "مَآ أَغْنَىٰ عَنْهُ مَالُهُۥ وَمَا كَسَبَ",
                2,
                111
            ],
            [
                "سَيَصْلَىٰ نَارًۭا ذَاتَ لَهَبٍۢ",
                3,
                111
            ],
            [
                "وَٱمْرَأَتُهُۥ حَمَّالَةَ ٱلْحَطَبِ",
                4,
                111
            ],
            [
                "فِى جِيدِهَا حَبْلٌۭ مِّن مَّسَدٍۭ",
                5,
                111
            ],
            [
                " قُلْ هُوَ ٱللَّهُ أَحَدٌ",
                1,
                112
            ],
            [
                "ٱللَّهُ ٱلصَّمَدُ",
                2,
                112
            ],
            [
                "لَمْ يَلِدْ وَلَمْ يُولَدْ",
                3,
                112
            ],
            [
                "وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ",
                4,
                112
            ],
            [
                " قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ",
                1,
                113
            ],
            [
                "مِن شَرِّ مَا خَلَقَ",
                2,
                113
            ],
            [
                "وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ",
                3,
                113
            ],
            [
                "وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ",
                4,
                113
            ],
            [
                "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
                5,
                113
            ],
            [
                " قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ",
                1,
                114
            ],
            [
                "مَلِكِ ٱلنَّاسِ",
                2,
                114
            ],
            [
                "إِلَٰهِ ٱلنَّاسِ",
                3,
                114
            ],
            [
                "مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ",
                4,
                114
            ],
            [
                "ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ",
                5,
                114
            ],
            [
                "مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
                6,
                114
            ]
        ];
        for ($i = 0; $i < count($ayat); $i++) {
            Ayat::create([
                'surah_id' => Surah::where('urutan', $ayat[$i][2])->first()->id,
                'ayat' => $ayat[$i][0],
                'urutan_ayat' => $ayat[$i][1]
            ]);
        }
    }
}
